[
  {
    "type": "experience",
    "title": "Creative Designer at J Passport",
    "years": "2023-2024",
    "description": "I design 2–3 articles and email marketing visuals weekly using Beefree, while coordinating directly with clients to align content with their restaurant promotions. I handle customer support follow-ups, use basic HTML to build newsletters, and segment mailing lists for targeted campaigns. I also generate monthly performance reports and contribute to strategic planning for each client’s marketing efforts. Beyond that, I create Shopify-based e-commerce websites, manage team schedules in Google Sheets, and assist the development team with app and system updates across beta and production environments."
  },
  {
    "type": "experience",
    "title": "Co-Founder at ClickSwipe",
    "years": "2022",
    "description": "ClickSwipe is a creative industry striving to create educational content within the science of international relations. As one of the Co-Founder, early on; I'm responsible for the development of ClickSwipe's brand identity and visual aspects.\n\nMy job description alias is the Lead Visual Designer for ClickSwipe."
  },
  {
    "type": "experience",
    "title": "Motion Graphics Designer at DIGIDES",
    "years": "2022",
    "description": "In DIGIDES, I was the project leader for developing educational and promotional content for their digital branding. I managed the task assignment for our group, in this project I tasked myself with making the motion graphic and editing their promotional video."
  },
  {
    "type": "experience",
    "title": "Creative Designer at TRISC",
    "years": "2021",
    "description": "In DIGIDES, I was the project leader for developing educational and promotional content for their digital branding. I managed the task assignment for our group, in this project I tasked myself with making the motion graphic and editing their promotional video."
  },
  {
    "type": "activity",
    "title": "Apple Developer Academy - @BINUS Bali Premiere (1st) Cohort",
    "years": "2025",
    "details": [
      "Description: Studied app development & product design with project-based learning.",
      "Skills Developed: Sketch, Xcode, Swift UI, Project Management.",
      "Achievements: Actively engaged in team discussions and developed community-focused apps."
    ]
  },
  {
    "type": "activity",
    "title": "International Congress: G20 Student Volunteer Leader & Liaison Officer",
    "years": "2022",
    "details": [
      "Description: Led 30 student volunteers from University of Jember to assist G20’s EO.",
      "Skills Developed: Leadership, Project Management, Hospitality, Professional English.",
      "Achievements: Successfully assisted EO with high approval from company’s CEO."
    ]
  },
  {
    "type": "activity",
    "title": "KMHDI (Indonesian Hindu Students Association)",
    "years": "2020-2024",
    "details": [
      "Role: Jember Branch President & National Board Member",
      "Activities: Led organizational programs, coordinated regional events, and represented student interests at an international forum.",
      "Achievements: Strengthened student networks and initiated impactful community projects."
    ]
  },
  {
    "type": "education",
    "title": "Universitas Jember",
    "years": "2019-2024",
    "details": [
      "International Relations",
      "President of Hindu Activity Unit",
      "Jember Branch President at KMHDI",
      "Part of Faculty’s International Accreditation Team",
      "Member of Model United Nation (MUN) Activity Unit."
    ]
  }
]
